Revit 2027 API
CoordinationModelLinkUtils.GetVisibilityOverrideForReferenceInsideCoordinationModel Method
 Gets the visibility for the provided reference inside the Coordination Model from Autodesk Docs.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetVisibilityOverrideForReferenceInsideCoordinationModel(
	Document document,
	View view,
	Element coordinationModelInstance,
	Reference reference
)
Public Shared Function GetVisibilityOverrideForReferenceInsideCoordinationModel (
	document As Document,
	view As View,
	coordinationModelInstance As Element,
	reference As Reference
) As Boolean
public:
static bool GetVisibilityOverrideForReferenceInsideCoordinationModel(
	Document^ document,
	View^ view,
	Element^ coordinationModelInstance,
	Reference^ reference
)
static member GetVisibilityOverrideForReferenceInsideCoordinationModel :
        document : Document *
        view : View *
        coordinationModelInstance : Element *
        reference : Reference -> bool
Parameters
document Document
 The document.
view View
 The view.
coordinationModelInstance Element
 The Coordination Model instance element where the provided reference is found.
reference Reference
 The reference to the element inside the provided Coordination Model instance.
Return Value
Boolean
 Returns the visibility for the provided reference inside the Coordination Model instance.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelInstance was not found in the given document. -or- The provided Reference is not a valid element inside the provided Coordination Model instance.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Remarks
 The reference should be a subelement of a Coordination Model instance.
 By default, the visibility setting has no override and its value is true.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace